package net.study.collection.list;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class ArrayListMethod {
    public static void main(String[] args) {
        List<String> list = new ArrayList<>();
        list.add("Ivan");
        list.add("Dima");
        list.add("Masha");
        list.add("Ira");
        list.add(1,"Andrey");// вставляем элемент по индексу, все остальные сдвигаем
        System.out.println(list);
//////////////////////////////////////////////////////////////////////////////////////////////////
        list.set(2, "Dmitry"); // заменяем элемент по индексу
        System.out.println("___________________");
        System.out.println(list);
//////////////////////////////////////////////////////////////////////////////////////////////////
        List<String> newList = new ArrayList<>(list); //копируем элементы в новый лист, два разных объекта
        System.out.println("___________________");
        System.out.println("New list" + newList);
        System.out.println("___________________");
//////////////////////////////////////////////////////////////////////////////////////////////////
        list.remove(0); // удаление элемента по индексу
        list.remove("Ira"); // удаление по значению
        System.out.println(list);
//////////////////////////////////////////////////////////////////////////////////////////////////
     //   list.addAll(newList); // добавляет все элементы листа
          list.addAll(1, newList); //добаляет все элементы начиная с индекса
        System.out.println(list);
//////////////////////////////////////////////////////////////////////////////////////////////////
          newList.clear(); // очищает лист
//////////////////////////////////////////////////////////////////////////////////////////////////
        System.out.println("Size :" + list.size() ); // возвращает размер
//////////////////////////////////////////////////////////////////////////////////////////////////
        System.out.println(list.indexOf("Ivan")); // возвращает индекс элемента
        list.add("Ivan");
        System.out.println(list.lastIndexOf("Ivan")); // так как лист может хранить дубликаты, то этот метод ищет последний
//////////////////////////////////////////////////////////////////////////////////////////////////
        System.out.println(newList.isEmpty()); // проверяет пустой ли лист
//////////////////////////////////////////////////////////////////////////////////////////////////
        System.out.println(list.contains("Andrey")); // содержит лист такой элемент
//////////////////////////////////////////////////////////////////////////////////////////////////
        System.out.println("____________________________");
        System.out.println("____________________________");






    }
}
